OpenNuvoton/M2354BSP/SampleCode/StdDriver/USBH_MassStorage/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V1.00
 * @brief    This sample uses a command-shell-like interface to demonstrate
 *           how to use USBH mass storage driver and make it working as a disk
 *           driver under FATFS file system.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>

#include "NuMicro.h"

#include "usbh_lib.h"
#include "ff.h"
#include "diskio.h"

#define BUFF_SIZE       (4*1024)

static UINT g_u8Len = BUFF_SIZE;
static DWORD s_u32AccSize;                         /* Work register for fs command */
static WORD s_u16AccFiles, s_u16AccDirs;
static FILINFO s_Finfo;
static FIL file1, file2;                           /* File objects */

static char s_achLine[256];                        /* Console input buffer */
#if _USE_LFN
char g_achLfname[512];
#endif

#ifdef __ICCARM__
#pragma data_alignment=32
BYTE s_au8BuffPool[BUFF_SIZE];       /* Working buffer */
BYTE s_au8BuffPool2[BUFF_SIZE];      /* Working buffer 2 */
#else
static BYTE s_au8BuffPool[BUFF_SIZE] __attribute__((aligned(32)));       /* Working buffer */
static BYTE s_au8BuffPool2[BUFF_SIZE] __attribute__((aligned(32)));      /* Working buffer 2 */
#endif

static BYTE *s_pu8Buff1;
static BYTE *s_pu8Buff2;

#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t s_au8Buff1[BUFF_SIZE] ;       /* Working buffer */
uint8_t s_au8Buff2[BUFF_SIZE] ;       /* Working buffer */
#else
static uint8_t s_au8Buff1[BUFF_SIZE] __attribute__((aligned(4)));       /* Working buffer */
static uint8_t s_au8Buff2[BUFF_SIZE] __attribute__((aligned(4)));       /* Working buffer */
#endif

static volatile int s_i8IntInCnt, s_i8IntOutCnt, s_i8IsoInCnt, s_i8IsoOutCnt;

static volatile uint32_t s_u32TickCnt;
static uint32_t s_u32T0;

void SysTick_Handler(void);
void enable_sys_tick(int ticks_per_second);
void timer_init(void);
uint32_t get_timer_value(void);
void delay_us(int usec);
void dump_buff_hex(uint8_t *pu8Buff, int i8Bytes);
int xatoi(TCHAR **str, long *res);
void put_dump(const unsigned char* buff, unsigned long addr, int cnt);
static FRESULT scan_files(char* path);
void put_rc(FRESULT rc);
void get_line(char *buff, int len);
unsigned long get_fattime(void);
void int_xfer_read(uint8_t *pu8DataBuff, int *pu8DataLen);
void int_xfer_write(uint8_t *pu8DataBuff, int *pu8DataLen);
void iso_xfer_write(uint8_t *pu8DataBuff, int u8DataLen);
void iso_xfer_read(uint8_t *pu8DataBuff, int u8DataLen);
void SYS_Init(void);
void UART0_Init(void);

void SysTick_Handler(void)
{
    s_u32TickCnt++;
}

void enable_sys_tick(int ticks_per_second)
{
    s_u32TickCnt = 0;
    if(SysTick_Config(SystemCoreClock / (uint32_t)ticks_per_second))
    {
        /* Setup SysTick Timer for 1 second interrupts  */
        printf("Set system tick error!!\n");
        while(1);
    }
}

uint32_t get_ticks(void)
{
    return s_u32TickCnt;
}

void timer_init(void)
{
    s_u32T0 = get_ticks();
}

uint32_t get_timer_value(void)
{
    return (get_ticks() - s_u32T0);
}

/*
 *  This function is necessary for USB Host library.
 */
void delay_us(int usec)
{
    /*
     *  Configure Timer0, clock source from XTL_12M. Prescale 12
     */
    /* TIMER0 clock from HXT */
    CLK->CLKSEL1 = (CLK->CLKSEL1 & (~CLK_CLKSEL1_TMR0SEL_Msk)) | CLK_CLKSEL1_TMR0SEL_HXT;
    CLK->APBCLK0 |= CLK_APBCLK0_TMR0CKEN_Msk;
    TIMER0->CTL = 0;        /* disable timer */
    TIMER0->INTSTS = 0x3;   /* write 1 to clear for safty */
    TIMER0->CMP = (uint32_t)usec;
    TIMER0->CTL = (11 << TIMER_CTL_PSC_Pos) | TIMER_ONESHOT_MODE | TIMER_CTL_CNTEN_Msk;

    while(!TIMER0->INTSTS);
}

void dump_buff_hex(uint8_t *pu8Buff, int i8Bytes)
{
    int i8Idx, i8Cnt;

    i8Idx = 0;
    while(i8Bytes > 0)
    {
        printf("0x%04X  ", i8Idx);
        for(i8Cnt = 0; i8Cnt < 16; i8Cnt++)
            printf("%02x ", pu8Buff[i8Idx + i8Cnt]);
        printf("  ");
        for(i8Cnt = 0; i8Cnt < 16; i8Cnt++)
        {
            if((pu8Buff[i8Idx + i8Cnt] >= 0x20) && (pu8Buff[i8Idx + i8Cnt] < 127))
                printf("%c", pu8Buff[i8Idx + i8Cnt]);
            else
                printf(".");
            i8Bytes--;
        }
        i8Idx += 16;
        printf("\n");
    }
    printf("\n");
}

/*--------------------------------------------------------------------------*/
/* Monitor                                                                  */
/*--------------------------------------------------------------------------*/
/*----------------------------------------------*/
/* Get a value of the string                    */
/*----------------------------------------------*/
/*  "123 -5   0x3ff 0b1111 0377  w "
        ^                           1st call returns 123 and next ptr
           ^                        2nd call returns -5 and next ptr
                   ^                3rd call returns 1023 and next ptr
                          ^         4th call returns 15 and next ptr
                               ^    5th call returns 255 and next ptr
                                  ^ 6th call fails and returns 0
*/

int xatoi           /* 0:Failed, 1:Successful */
(
    TCHAR **str,    /* Pointer to pointer to the string */
    long *res       /* Pointer to a variable to store the value */
)
{
    unsigned long val;
    unsigned char r, s = 0;
    TCHAR c;


    *res = 0;
    while((c = **str) == ' ')(*str)++;      /* Skip leading spaces */

    if(c == '-')        /* negative? */
    {
        s = 1;
        c = *(++(*str));
    }

    if(c == '0')
    {
        c = *(++(*str));
        switch(c)
        {
            case 'x':       /* hexadecimal */
                r = 16;
                c = *(++(*str));
                break;
            case 'b':       /* binary */
                r = 2;
                c = *(++(*str));
                break;
            default:
                if(c <= ' ') return 1;  /* single zero */
                if(c < '0' || c > '9') return 0;    /* invalid char */
                r = 8;      /* octal */
        }
    }
    else
    {
        if(c < '0' || c > '9') return 0;    /* EOL or invalid char */
        r = 10;         /* decimal */
    }

    val = 0;
    while(c > ' ')
    {
        if(c >= 'a') c -= 0x20;
        c -= '0';
        if(c >= 17)
        {
            c -= 7;
            if(c <= 9) return 0;    /* invalid char */
        }
        if(c >= r) return 0;        /* invalid char for current radix */
        val = val * r + c;
        c = *(++(*str));
    }
    if(s) val = 0 - val;            /* apply sign if needed */

    *res = (long)val;
    return 1;
}

/*----------------------------------------------*/
/* Dump a block of byte array                   */
/*----------------------------------------------*/
void put_dump
(
    const unsigned char* buff,  /* Pointer to the byte array to be dumped */
    unsigned long addr,         /* Heading address value */
    int cnt                     /* Number of bytes to be dumped */
)
{
    int i;


    printf("%08x ", (UINT)addr);

    for(i = 0; i < cnt; i++)
        printf(" %02x", buff[i]);

