OpenNuvoton/M2354BSP/SampleCode/StdDriver/USBH_MassStorage/main.c
    /* Set multi-function pins for UART0 RXD and TXD */
    SYS->GPA_MFPL = (SYS->GPA_MFPL & (~(UART0_RXD_PA6_Msk | UART0_TXD_PA7_Msk))) | UART0_RXD_PA6 | UART0_TXD_PA7;

    /* USB_VBUS_EN (USB 1.1 VBUS power enable pin) multi-function pin - PB.15     */
    SYS->GPB_MFPH = (SYS->GPB_MFPH & ~SYS_GPB_MFPH_PB15MFP_Msk) | SYS_GPB_MFPH_PB15MFP_USB_VBUS_EN;

    /* USB_VBUS_ST (USB 1.1 over-current detect pin) multi-function pin - PB.14   */
    SYS->GPB_MFPH = (SYS->GPB_MFPH & ~SYS_GPB_MFPH_PB14MFP_Msk) | SYS_GPB_MFPH_PB14MFP_USB_VBUS_ST;

    /* USB 1.1 port multi-function pin VBUS, D+, D-, and ID pins */
    SYS->GPA_MFPH &= ~(SYS_GPA_MFPH_PA12MFP_Msk | SYS_GPA_MFPH_PA13MFP_Msk |
                       SYS_GPA_MFPH_PA14MFP_Msk | SYS_GPA_MFPH_PA15MFP_Msk);
    SYS->GPA_MFPH |= SYS_GPA_MFPH_PA12MFP_USB_VBUS | SYS_GPA_MFPH_PA13MFP_USB_D_N |
                     SYS_GPA_MFPH_PA14MFP_USB_D_P | SYS_GPA_MFPH_PA15MFP_USB_OTG_ID;

    /* Lock protected registers */
    SYS_LockReg();
}

void UART0_Init(void)
{
    /* Configure UART0 and set UART0 baud rate */
    UART_Open(UART0, 115200);
}

int32_t main(void)
{
    char *ptr, *ptr2;
    long p1, p2, p3;
    BYTE *buf;
    FATFS *fs;              /* Pointer to file system object */
    TCHAR usb_path[] = { '3', ':', 0 };    /* USB drive started from 3 */
    FRESULT res;

    DIR dir;                /* Directory object */
    UINT s1, s2, cnt, sector_no;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;

    SYS_Init();                        /* Init System, IP clock and multi-function I/O */

    UART0_Init();                      /* Initialize UART0 */

    enable_sys_tick(100);

    printf("\n\n");
    printf("+--------------------------------------------+\n");
    printf("|                                            |\n");
    printf("|    USB Host Mass Storage sample program    |\n");
    printf("|                                            |\n");
    printf("+--------------------------------------------+\n");

    s_pu8Buff1 = (BYTE *)((uint32_t)&s_au8BuffPool[0]);
    s_pu8Buff2 = (BYTE *)((uint32_t)&s_au8BuffPool2[0]);

    usbh_core_init();
    usbh_umas_init();
    usbh_pooling_hubs();

    printf("Init time: %d\n", get_ticks());

    s_i8IntInCnt = s_i8IntOutCnt = s_i8IsoInCnt = s_i8IsoOutCnt = 0;

    f_chdrive(usb_path);               /* set default path                                */

    for(;;)
    {
        usbh_pooling_hubs();

        usbh_memory_used();            /* print out UsbHostLib memory usage information   */

        printf(_T(">"));
        ptr = s_achLine;

        get_line(ptr, sizeof(s_achLine));

        switch(*ptr++)
        {
            case 'q' :  /* Exit program */
                return 0;

            case '5':
                for(sector_no = 0; sector_no < 128000; sector_no++)
                {
                    if(sector_no % 1000 == 0)
                        printf("\nLBK transfer count: Ii:%d, Io: %d, Si:%d, So:%d\n", s_i8IntInCnt, s_i8IntOutCnt, s_i8IsoInCnt, s_i8IsoOutCnt);

                    printf("Test sector %d\r", sector_no);

                    memset(s_au8Buff1, 87, 512);
                    memset(s_au8Buff2, 0x87, 512);

                    res = (FRESULT)disk_read(3, s_au8Buff1, sector_no, 1);
                    if(res)
                    {
                        printf("read failed at %d, rc=%d\n", sector_no, (WORD)res);
                        put_rc(res);
                        break;
                    }

                    res = (FRESULT)disk_read(3, s_au8Buff2, sector_no, 1);
                    if(res)
                    {
                        printf("read failed at %d, rc=%d\n", sector_no, (WORD)res);
                        put_rc(res);
                        break;
                    }

                    if(memcmp(s_au8Buff1, s_au8Buff2, 512) != 0)
                    {
                        printf("\nData compare failed!!\n");
                        break;
                    }
                }
                break;

            case '4' :
            case '6' :
            case '7' :
                ptr--;
                *(ptr + 1) = ':';
                *(ptr + 2) = 0;
                put_rc(f_chdrive((TCHAR *)ptr));
                break;

            case 'd' :
                switch(*ptr++)
                {
                    case 'd' :  /* dd [<lba>] - Dump sector */
                        if(!xatoi(&ptr, &p2)) p2 = (long)sect;
                        res = (FRESULT)disk_read(3, s_pu8Buff1, (DWORD)p2, 1);
                        if(res)
                        {
                            printf("rc=%d\n", (WORD)res);
                            break;
                        }
                        sect = (DWORD)(p2 + 1);
                        printf("Sector:%d\n", (INT)p2);
                        for(buf = (unsigned char*)s_pu8Buff1, ofs = 0; ofs < 0x200; buf += 16, ofs += 16)
                            put_dump(buf, ofs, 16);
                        break;

                    case 't' :  /* dt - raw sector read/write performance test */
                        printf("Raw sector read performance test...\n");
                        timer_init();
                        for(s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                        {
                            s2 = BUFF_SIZE / 512;   /* sector count for each read  */
                            res = (FRESULT)disk_read(3, s_pu8Buff1, 10000 + s1 * s2, s2);
                            if(res)
                            {
                                printf("read failed at %d, rc=%d\n", 10000 + s1 * s2, (WORD)res);
                                put_rc(res);
                                break;
                            }
                            if(s1 % 256 == 0)
                                printf("%d KB\n", (s1 * BUFF_SIZE) / 1024);
                        }
                        p1 = (long)get_timer_value();
                        printf("time = %d.%02d\n", (INT)(p1 / 100), (INT)(p1 % 100));
                        printf("Raw read speed: %d KB/s\n", (INT)(((0x800000 * 100) / p1) / 1024));

                        printf("Raw sector write performance test...\n");
                        timer_init();
                        for(s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                        {
                            s2 = BUFF_SIZE / 512;   /* sector count for each read  */
                            res = (FRESULT)disk_write(3, s_pu8Buff1, 20000 + s1 * s2, s2);
                            if(res)
                            {
                                printf("write failed at %d, rc=%d\n", 20000 + s1 * s2, (WORD)res);
                                put_rc(res);
                                break;
                            }
                            if(s1 % 256 == 0)
                                printf("%d KB\n", (s1 * BUFF_SIZE) / 1024);
                        }
                        p1 = (long)get_timer_value();
                        printf("time = %d.%02d\n", (INT)(p1 / 100), (INT)(p1 % 100));
                        printf("Raw write speed: %d KB/s\n", (INT)(((0x800000 * 100) / p1) / 1024));
                        break;

